In [3]:
import pandas as pd
import seaborn as sns
import matplotlib as plt
import numpy as np
%matplotlib inline

print(pd.__version__)
print(sns.__version__)
print(plt.__version__)
print(np.__version__)

1.4.4
0.12.0
3.6.0
1.23.3

In [4]:
train_df=pd.read_csv("./dataframes/train.csv")
test_df=pd.read_csv("./dataframes/test.csv")
print(train_df.shape,test_df.shape)

(891, 12) (418, 11)

In [5]:
train_df.rename(columns={'PassengerId':'승객번호','Survived' : '생존여부', 'Pclass' : '좌석등급', 'Name':'이름', 'Sex':'성별','Age':'나이', 'SibSp' : '혈족', 'Parch':'직계','Ticket':'승선권', 'Fare':'요금', 'Cabin':'객실번호','Embarked':'승선항'}, inplace=True)

In [4]:
# 상단 5개 출력
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
# 샘플 무작위 10개
train_df.sample(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
531,532,0,3,"Toufik, Mr. Nakli",male,NaN,0,0,2641,7.2292,NaN,C
167,168,0,3,"Skoog, Mrs. William (Anna Bernhardina Karlsson)",female,45.0,1,4,347088,27.9000,NaN,S
201,202,0,3,"Sage, Mr. Frederick",male,NaN,8,2,CA. 2343,69.5500,NaN,S
91,92,0,3,"Andreasson, Mr. Paul Edvin",male,20.0,0,0,347466,7.8542,NaN,S
34,35,0,1,"Meyer, Mr. Edgar Joseph",male,28.0,1,0,PC 17604,82.1708,NaN,C
401,402,0,3,"Adams, Mr. John",male,26.0,0,0,341826,8.0500,NaN,S
254,255,0,3,"Rosblom, Mrs. Viktor (Helena Wilhelmina)",female,41.0,0,2,370129,20.2125,NaN,S
211,212,1,2,"Cameron, Miss. Clear Annie",female,35.0,0,0,F.C.C. 13528,21.0000,NaN,S
448,449,1,3,"Baclini, Miss. Marie Catherine",female,5.0,2,1,2666,19.2583,NaN,C
404,405,0,3,"Oreskovic, Miss. Marija",female,20.0,0,0,315096,8.6625,NaN,S

In [6]:
# 칼럼 제목만 출력
train_df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [7]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

# 칼럼 (Features, 특징)

attribute|Info|Type|DType
---|---|---|---
 Passenger| 승객번호 | |int
 Survived |생존여부 0=No, 1=Yes| 명목형|int
 Pclass |티켓 클래스 1=1st, 2=2nd, 3=3rd|순서형|int
 Name|이름| 불확실한 데이터|object
 Sex |성별|명목형|object
 Age |나이|연속형|float
 SibSp| 형제, 자매, 배우자가 배에 탄수|이산형|int
 Parch| 부모, 자식이 배에 탄수|이산형|int
 Ticket| 티켓 번호|혼합형|object
 Fare| 지불 금액|연속형|float
 Cabin| 객실 번호 |혼합형|object
 Embarked| 승선항 C=Cherbourg, Q= Queenstown, S=Southampton| 명목형|object

In [9]:
# 분포 중심 경향 확인
train_df.describe()

,승객번호,생존여부,좌석등급,나이,혈족,직계,요금
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [10]:
train_df.요금.max()

512.3292

- 실제 탑승자(2,224명)의 40%인 891명
- 생존률 38%
- 가장 비싼 승선 요금은 512.

In [11]:
train_df.index

RangeIndex(start=0, stop=891, step=1)

In [12]:
train_df.dtypes

승객번호      int64
생존여부      int64
좌석등급      int64
이름       object
성별       object
나이      float64
혈족        int64
직계        int64
승선권      object
요금      float64
객실번호     object
승선항      object
dtype: object

In [13]:
train_df.select_dtypes(include='float64')

       나이       요금
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

In [14]:
train_df.select_dtypes(include='int64')

     승객번호  생존여부  좌석등급  혈족  직계
0       1     0     3   1   0
1       2     1     1   1   0
2       3     1     3   0   0
3       4     1     1   1   0
4       5     0     3   0   0
..    ...   ...   ...  ..  ..
886   887     0     2   0   0
887   888     1     1   0   0
888   889     0     3   1   2
889   890     1     1   0   0
890   891     0     3   0   0

[891 rows x 5 columns]

In [15]:
train_df.values

array([[1, 0, 3, ..., 7.25, nan, 'S'],
       [2, 1, 1, ..., 71.2833, 'C85', 'C'],
       [3, 1, 3, ..., 7.925, nan, 'S'],
       ...,
       [889, 0, 3, ..., 23.45, nan, 'S'],
       [890, 1, 1, ..., 30.0, 'C148', 'C'],
       [891, 0, 3, ..., 7.75, nan, 'Q']], dtype=object)

In [16]:
train_df.axes

[RangeIndex(start=0, stop=891, step=1),
 Index(['승객번호', '생존여부', '좌석등급', '이름', '성별', '나이', '혈족', '직계', '승선권', '요금',
        '객실번호', '승선항'],
       dtype='object')]

In [17]:
train_df.ndim

2

In [18]:
train_df.size

10692

In [19]:
train_df.shape

(891, 12)

In [20]:
train_df.empty

False

In [9]:
train_df.승선항.unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [6]:
train_df.좌석등급.unique()

array([3, 1, 2])

In [7]:
train_df.좌석등급.value_counts()

3    491
1    216
2    184
Name: 좌석등급, dtype: int64

In [22]:
train_df.나이.cummax

<bound method NDFrame._add_numeric_operations.<locals>.cummax of 0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: 나이, Length: 891, dtype: float64>

In [23]:
train_df.요금.cummax()

0        7.2500
1       71.2833
2       71.2833
3       71.2833
4       71.2833
         ...
886    512.3292
887    512.3292
888    512.3292
889    512.3292
890    512.3292
Name: 요금, Length: 891, dtype: float64

In [24]:
train_df.diff

<bound method DataFrame.diff of      승객번호  생존여부  좌석등급                                                 이름  \
0       1     0     3                            Braund, Mr. Owen Harris
1       2     1     1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2       3     1     3                             Heikkinen, Miss. Laina
3       4     1     1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4       5     0     3                           Allen, Mr. William Henry
..    ...   ...   ...                                                ...
886   887     0     2                              Montvila, Rev. Juozas
887   888     1     1                       Graham, Miss. Margaret Edith
888   889     0     3           Johnston, Miss. Catherine Helen "Carrie"
889   890     1     1                              Behr, Mr. Karl Howell
890   891     0     3                                Dooley, Mr. Patrick

         성별    나이  혈족  직계               승선권       요금  객실번호 승선항
0      male  22.0   1   0         A/5 21171   7.2500   NaN   S
1    female  38.0   1   0          PC 17599  71.2833   C85   C
2    female  26.0   0   0  STON/O2. 3101282   7.9250   NaN   S
3    female  35.0   1   0            113803  53.1000  C123   S
4      male  35.0   0   0            373450   8.0500   NaN   S
..      ...   ...  ..  ..               ...      ...   ...  ..
886    male  27.0   0   0            211536  13.0000   NaN   S
887  female  19.0   0   0            112053  30.0000   B42   S
888  female   NaN   1   2        W./C. 6607  23.4500   NaN   S
889    male  26.0   0   0            111369  30.0000  C148   C
890    male  32.0   0   0            370376   7.7500   NaN   Q

[891 rows x 12 columns]>

In [25]:
train_df.max()

/tmp/ipykernel_129073/2960503394.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  train_df.max()

승객번호                            891
생존여부                              1
좌석등급                              3
이름      van Melkebeke, Mr. Philemon
성별                             male
나이                             80.0
혈족                                8
직계                                6
승선권                       WE/P 5735
요금                         512.3292
dtype: object

In [26]:
train_df.std(skipna=True)

/tmp/ipykernel_129073/962627295.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  train_df.std(skipna=True)

승객번호    257.353842
생존여부      0.486592
좌석등급      0.836071
나이       14.526497
혈족        1.102743
직계        0.806057
요금       49.693429
dtype: float64

In [27]:
train_df.std(skipna=False)

/tmp/ipykernel_129073/3032389448.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  train_df.std(skipna=False)

승객번호    257.353842
생존여부      0.486592
좌석등급      0.836071
나이             NaN
혈족        1.102743
직계        0.806057
요금       49.693429
dtype: float64

In [28]:
train_df.asfreq

<bound method DataFrame.asfreq of      승객번호  생존여부  좌석등급                                                 이름  \
0       1     0     3                            Braund, Mr. Owen Harris
1       2     1     1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2       3     1     3                             Heikkinen, Miss. Laina
3       4     1     1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4       5     0     3                           Allen, Mr. William Henry
..    ...   ...   ...                                                ...
886   887     0     2                              Montvila, Rev. Juozas
887   888     1     1                       Graham, Miss. Margaret Edith
888   889     0     3           Johnston, Miss. Catherine Helen "Carrie"
889   890     1     1                              Behr, Mr. Karl Howell
890   891     0     3                                Dooley, Mr. Patrick

         성별    나이  혈족  직계               승선권       요금  객실번호 승선항
0      male  22.0   1   0         A/5 21171   7.2500   NaN   S
1    female  38.0   1   0          PC 17599  71.2833   C85   C
2    female  26.0   0   0  STON/O2. 3101282   7.9250   NaN   S
3    female  35.0   1   0            113803  53.1000  C123   S
4      male  35.0   0   0            373450   8.0500   NaN   S
..      ...   ...  ..  ..               ...      ...   ...  ..
886    male  27.0   0   0            211536  13.0000   NaN   S
887  female  19.0   0   0            112053  30.0000   B42   S
888  female   NaN   1   2        W./C. 6607  23.4500   NaN   S
889    male  26.0   0   0            111369  30.0000  C148   C
890    male  32.0   0   0            370376   7.7500   NaN   Q

[891 rows x 12 columns]>

In [38]:
train_df[['좌석등급','생존여부']].groupby(['좌석등급']).mean()

          생존여부
좌석등급
1     0.629630
2     0.472826
3     0.242363

- 좌석등급에 따른 생존여부가 1등급이 높게 나왔다. 등급별 인원은 어떻게 되는가?

In [44]:
train_df.describe()

,승객번호,생존여부,좌석등급,나이,혈족,직계,요금
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [47]:
train_df.isnull().mean()*100

승객번호     0.000000
생존여부     0.000000
좌석등급     0.000000
이름       0.000000
성별       0.000000
나이      19.865320
혈족       0.000000
직계       0.000000
승선권      0.000000
요금       0.000000
객실번호    77.104377
승선항      0.224467
dtype: float64

In [6]:
train_df[['좌석등급','생존여부']].groupby(['좌석등급']).mean()*100

           생존여부
좌석등급
1     62.962963
2     47.282609
3     24.236253

In [21]:
(train_df[['좌석등급']].value_counts()/891)*100

좌석등급
3       55.106622
1       24.242424
2       20.650954
dtype: float64